Python 3.6.3 (v3.6.3:2c5fed8, Oct  3 2017, 17:26:49) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
[]
[]
4 可以被 2 整除 不是质数
[]
[]
6 可以被 2 整除 不是质数
6 可以被 3 整除 不是质数
[]
[]
8 可以被 2 整除 不是质数
8 可以被 4 整除 不是质数
[]
9 可以被 3 整除 不是质数
[]
10 可以被 2 整除 不是质数
10 可以被 5 整除 不是质数
[]
[]
12 可以被 2 整除 不是质数
12 可以被 3 整除 不是质数
12 可以被 4 整除 不是质数
12 可以被 6 整除 不是质数
[]
[]
14 可以被 2 整除 不是质数
14 可以被 7 整除 不是质数
[]
15 可以被 3 整除 不是质数
15 可以被 5 整除 不是质数
[]
16 可以被 2 整除 不是质数
16 可以被 4 整除 不是质数
16 可以被 8 整除 不是质数
[]
[]
18 可以被 2 整除 不是质数
18 可以被 3 整除 不是质数
18 可以被 6 整除 不是质数
18 可以被 9 整除 不是质数
[]
[]
20 可以被 2 整除 不是质数
20 可以被 4 整除 不是质数
20 可以被 5 整除 不是质数
20 可以被 10 整除 不是质数
[]
21 可以被 3 整除 不是质数
21 可以被 7 整除 不是质数
[]
22 可以被 2 整除 不是质数
22 可以被 11 整除 不是质数
[]
[]
24 可以被 2 整除 不是质数
24 可以被 3 整除 不是质数
24 可以被 4 整除 不是质数
24 可以被 6 整除 不是质数
24 可以被 8 整除 不是质数
24 可以被 12 整除 不是质数
[]
25 可以被 5 整除 不是质数
[]
26 可以被 2 整除 不是质数
26 可以被 13 整除 不是质数
[]
27 可以被 3 整除 不是质数
27 可以被 9 整除 不是质数
[]
28 可以被 2 整除 不是质数
28 可以被 4 整除 不是质数
28 可以被 7 整除 不是质数
28 可以被 14 整除 不是质数
[]
[]
30 可以被 2 整除 不是质数
30 可以被 3 整除 不是质数
30 可以被 5 整除 不是质数
30 可以被 6 整除 不是质数
30 可以被 10 整除 不是质数
30 可以被 15 整除 不是质数
[]
[]
32 可以被 2 整除 不是质数
32 可以被 4 整除 不是质数
32 可以被 8 整除 不是质数
32 可以被 16 整除 不是质数
[]
33 可以被 3 整除 不是质数
33 可以被 11 整除 不是质数
[]
34 可以被 2 整除 不是质数
34 可以被 17 整除 不是质数
[]
35 可以被 5 整除 不是质数
35 可以被 7 整除 不是质数
[]
36 可以被 2 整除 不是质数
36 可以被 3 整除 不是质数
36 可以被 4 整除 不是质数
36 可以被 6 整除 不是质数
36 可以被 9 整除 不是质数
36 可以被 12 整除 不是质数
36 可以被 18 整除 不是质数
[]
[]
38 可以被 2 整除 不是质数
38 可以被 19 整除 不是质数
[]
39 可以被 3 整除 不是质数
39 可以被 13 整除 不是质数
[]
40 可以被 2 整除 不是质数
40 可以被 4 整除 不是质数
40 可以被 5 整除 不是质数
40 可以被 8 整除 不是质数
40 可以被 10 整除 不是质数
40 可以被 20 整除 不是质数
[]
[]
42 可以被 2 整除 不是质数
42 可以被 3 整除 不是质数
42 可以被 6 整除 不是质数
42 可以被 7 整除 不是质数
42 可以被 14 整除 不是质数
42 可以被 21 整除 不是质数
[]
[]
44 可以被 2 整除 不是质数
44 可以被 4 整除 不是质数
44 可以被 11 整除 不是质数
44 可以被 22 整除 不是质数
[]
45 可以被 3 整除 不是质数
45 可以被 5 整除 不是质数
45 可以被 9 整除 不是质数
45 可以被 15 整除 不是质数
[]
46 可以被 2 整除 不是质数
46 可以被 23 整除 不是质数
[]
[]
48 可以被 2 整除 不是质数
48 可以被 3 整除 不是质数
48 可以被 4 整除 不是质数
48 可以被 6 整除 不是质数
48 可以被 8 整除 不是质数
48 可以被 12 整除 不是质数
48 可以被 16 整除 不是质数
48 可以被 24 整除 不是质数
[]
49 可以被 7 整除 不是质数
[]
50 可以被 2 整除 不是质数
50 可以被 5 整除 不是质数
50 可以被 10 整除 不是质数
50 可以被 25 整除 不是质数
[]
51 可以被 3 整除 不是质数
51 可以被 17 整除 不是质数
[]
52 可以被 2 整除 不是质数
52 可以被 4 整除 不是质数
52 可以被 13 整除 不是质数
52 可以被 26 整除 不是质数
[]
[]
54 可以被 2 整除 不是质数
54 可以被 3 整除 不是质数
54 可以被 6 整除 不是质数
54 可以被 9 整除 不是质数
54 可以被 18 整除 不是质数
54 可以被 27 整除 不是质数
[]
55 可以被 5 整除 不是质数
55 可以被 11 整除 不是质数
[]
56 可以被 2 整除 不是质数
56 可以被 4 整除 不是质数
56 可以被 7 整除 不是质数
56 可以被 8 整除 不是质数
56 可以被 14 整除 不是质数
56 可以被 28 整除 不是质数
[]
57 可以被 3 整除 不是质数
57 可以被 19 整除 不是质数
[]
58 可以被 2 整除 不是质数
58 可以被 29 整除 不是质数
[]
[]
60 可以被 2 整除 不是质数
60 可以被 3 整除 不是质数
60 可以被 4 整除 不是质数
60 可以被 5 整除 不是质数
60 可以被 6 整除 不是质数
60 可以被 10 整除 不是质数
60 可以被 12 整除 不是质数
60 可以被 15 整除 不是质数
60 可以被 20 整除 不是质数
60 可以被 30 整除 不是质数
[]
[]
62 可以被 2 整除 不是质数
62 可以被 31 整除 不是质数
[]
63 可以被 3 整除 不是质数
63 可以被 7 整除 不是质数
63 可以被 9 整除 不是质数
63 可以被 21 整除 不是质数
[]
64 可以被 2 整除 不是质数
64 可以被 4 整除 不是质数
64 可以被 8 整除 不是质数
64 可以被 16 整除 不是质数
64 可以被 32 整除 不是质数
[]
65 可以被 5 整除 不是质数
65 可以被 13 整除 不是质数
[]
66 可以被 2 整除 不是质数
66 可以被 3 整除 不是质数
66 可以被 6 整除 不是质数
66 可以被 11 整除 不是质数
66 可以被 22 整除 不是质数
66 可以被 33 整除 不是质数
[]
[]
68 可以被 2 整除 不是质数
68 可以被 4 整除 不是质数
68 可以被 17 整除 不是质数
68 可以被 34 整除 不是质数
[]
69 可以被 3 整除 不是质数
69 可以被 23 整除 不是质数
[]
70 可以被 2 整除 不是质数
70 可以被 5 整除 不是质数
70 可以被 7 整除 不是质数
70 可以被 10 整除 不是质数
70 可以被 14 整除 不是质数
70 可以被 35 整除 不是质数
[]
[]
72 可以被 2 整除 不是质数
72 可以被 3 整除 不是质数
72 可以被 4 整除 不是质数
72 可以被 6 整除 不是质数
72 可以被 8 整除 不是质数
72 可以被 9 整除 不是质数
72 可以被 12 整除 不是质数
72 可以被 18 整除 不是质数
72 可以被 24 整除 不是质数
72 可以被 36 整除 不是质数
[]
[]
74 可以被 2 整除 不是质数
74 可以被 37 整除 不是质数
[]
75 可以被 3 整除 不是质数
75 可以被 5 整除 不是质数
75 可以被 15 整除 不是质数
75 可以被 25 整除 不是质数
[]
76 可以被 2 整除 不是质数
76 可以被 4 整除 不是质数
76 可以被 19 整除 不是质数
76 可以被 38 整除 不是质数
[]
77 可以被 7 整除 不是质数
77 可以被 11 整除 不是质数
[]
78 可以被 2 整除 不是质数
78 可以被 3 整除 不是质数
78 可以被 6 整除 不是质数
78 可以被 13 整除 不是质数
78 可以被 26 整除 不是质数
78 可以被 39 整除 不是质数
[]
[]
80 可以被 2 整除 不是质数
80 可以被 4 整除 不是质数
80 可以被 5 整除 不是质数
80 可以被 8 整除 不是质数
80 可以被 10 整除 不是质数
80 可以被 16 整除 不是质数
80 可以被 20 整除 不是质数
80 可以被 40 整除 不是质数
[]
81 可以被 3 整除 不是质数
81 可以被 9 整除 不是质数
81 可以被 27 整除 不是质数
[]
82 可以被 2 整除 不是质数
82 可以被 41 整除 不是质数
[]
[]
84 可以被 2 整除 不是质数
84 可以被 3 整除 不是质数
84 可以被 4 整除 不是质数
84 可以被 6 整除 不是质数
84 可以被 7 整除 不是质数
84 可以被 12 整除 不是质数
84 可以被 14 整除 不是质数
84 可以被 21 整除 不是质数
84 可以被 28 整除 不是质数
84 可以被 42 整除 不是质数
[]
85 可以被 5 整除 不是质数
85 可以被 17 整除 不是质数
[]
86 可以被 2 整除 不是质数
86 可以被 43 整除 不是质数
[]
87 可以被 3 整除 不是质数
87 可以被 29 整除 不是质数
[]
88 可以被 2 整除 不是质数
88 可以被 4 整除 不是质数
88 可以被 8 整除 不是质数
88 可以被 11 整除 不是质数
88 可以被 22 整除 不是质数
88 可以被 44 整除 不是质数
[]
[]
90 可以被 2 整除 不是质数
90 可以被 3 整除 不是质数
90 可以被 5 整除 不是质数
90 可以被 6 整除 不是质数
90 可以被 9 整除 不是质数
90 可以被 10 整除 不是质数
90 可以被 15 整除 不是质数
90 可以被 18 整除 不是质数
90 可以被 30 整除 不是质数
90 可以被 45 整除 不是质数
[]
91 可以被 7 整除 不是质数
91 可以被 13 整除 不是质数
[]
92 可以被 2 整除 不是质数
92 可以被 4 整除 不是质数
92 可以被 23 整除 不是质数
92 可以被 46 整除 不是质数
[]
93 可以被 3 整除 不是质数
93 可以被 31 整除 不是质数
[]
94 可以被 2 整除 不是质数
94 可以被 47 整除 不是质数
[]
95 可以被 5 整除 不是质数
95 可以被 19 整除 不是质数
[]
96 可以被 2 整除 不是质数
96 可以被 3 整除 不是质数
96 可以被 4 整除 不是质数
96 可以被 6 整除 不是质数
96 可以被 8 整除 不是质数
96 可以被 12 整除 不是质数
96 可以被 16 整除 不是质数
96 可以被 24 整除 不是质数
96 可以被 32 整除 不是质数
96 可以被 48 整除 不是质数
[]
[]
98 可以被 2 整除 不是质数
98 可以被 7 整除 不是质数
98 可以被 14 整除 不是质数
98 可以被 49 整除 不是质数
[]
99 可以被 3 整除 不是质数
99 可以被 9 整除 不是质数
99 可以被 11 整除 不是质数
99 可以被 33 整除 不是质数
[]
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
2 是质数
3 是质数
4 可以被 2 整除 不是质数
4 是质数
5 是质数
6 可以被 2 整除 不是质数
6 可以被 3 整除 不是质数
6 是质数
7 是质数
8 可以被 2 整除 不是质数
8 可以被 4 整除 不是质数
8 是质数
9 可以被 3 整除 不是质数
9 是质数
10 可以被 2 整除 不是质数
10 可以被 5 整除 不是质数
10 是质数
11 是质数
12 可以被 2 整除 不是质数
12 可以被 3 整除 不是质数
12 可以被 4 整除 不是质数
12 可以被 6 整除 不是质数
12 是质数
13 是质数
14 可以被 2 整除 不是质数
14 可以被 7 整除 不是质数
14 是质数
15 可以被 3 整除 不是质数
15 可以被 5 整除 不是质数
15 是质数
16 可以被 2 整除 不是质数
16 可以被 4 整除 不是质数
16 可以被 8 整除 不是质数
16 是质数
17 是质数
18 可以被 2 整除 不是质数
18 可以被 3 整除 不是质数
18 可以被 6 整除 不是质数
18 可以被 9 整除 不是质数
18 是质数
19 是质数
20 可以被 2 整除 不是质数
20 可以被 4 整除 不是质数
20 可以被 5 整除 不是质数
20 可以被 10 整除 不是质数
20 是质数
21 可以被 3 整除 不是质数
21 可以被 7 整除 不是质数
21 是质数
22 可以被 2 整除 不是质数
22 可以被 11 整除 不是质数
22 是质数
23 是质数
24 可以被 2 整除 不是质数
24 可以被 3 整除 不是质数
24 可以被 4 整除 不是质数
24 可以被 6 整除 不是质数
24 可以被 8 整除 不是质数
24 可以被 12 整除 不是质数
24 是质数
25 可以被 5 整除 不是质数
25 是质数
26 可以被 2 整除 不是质数
26 可以被 13 整除 不是质数
26 是质数
27 可以被 3 整除 不是质数
27 可以被 9 整除 不是质数
27 是质数
28 可以被 2 整除 不是质数
28 可以被 4 整除 不是质数
28 可以被 7 整除 不是质数
28 可以被 14 整除 不是质数
28 是质数
29 是质数
30 可以被 2 整除 不是质数
30 可以被 3 整除 不是质数
30 可以被 5 整除 不是质数
30 可以被 6 整除 不是质数
30 可以被 10 整除 不是质数
30 可以被 15 整除 不是质数
30 是质数
31 是质数
32 可以被 2 整除 不是质数
32 可以被 4 整除 不是质数
32 可以被 8 整除 不是质数
32 可以被 16 整除 不是质数
32 是质数
33 可以被 3 整除 不是质数
33 可以被 11 整除 不是质数
33 是质数
34 可以被 2 整除 不是质数
34 可以被 17 整除 不是质数
34 是质数
35 可以被 5 整除 不是质数
35 可以被 7 整除 不是质数
35 是质数
36 可以被 2 整除 不是质数
36 可以被 3 整除 不是质数
36 可以被 4 整除 不是质数
36 可以被 6 整除 不是质数
36 可以被 9 整除 不是质数
36 可以被 12 整除 不是质数
36 可以被 18 整除 不是质数
36 是质数
37 是质数
38 可以被 2 整除 不是质数
38 可以被 19 整除 不是质数
38 是质数
39 可以被 3 整除 不是质数
39 可以被 13 整除 不是质数
39 是质数
40 可以被 2 整除 不是质数
40 可以被 4 整除 不是质数
40 可以被 5 整除 不是质数
40 可以被 8 整除 不是质数
40 可以被 10 整除 不是质数
40 可以被 20 整除 不是质数
40 是质数
41 是质数
42 可以被 2 整除 不是质数
42 可以被 3 整除 不是质数
42 可以被 6 整除 不是质数
42 可以被 7 整除 不是质数
42 可以被 14 整除 不是质数
42 可以被 21 整除 不是质数
42 是质数
43 是质数
44 可以被 2 整除 不是质数
44 可以被 4 整除 不是质数
44 可以被 11 整除 不是质数
44 可以被 22 整除 不是质数
44 是质数
45 可以被 3 整除 不是质数
45 可以被 5 整除 不是质数
45 可以被 9 整除 不是质数
45 可以被 15 整除 不是质数
45 是质数
46 可以被 2 整除 不是质数
46 可以被 23 整除 不是质数
46 是质数
47 是质数
48 可以被 2 整除 不是质数
48 可以被 3 整除 不是质数
48 可以被 4 整除 不是质数
48 可以被 6 整除 不是质数
48 可以被 8 整除 不是质数
48 可以被 12 整除 不是质数
48 可以被 16 整除 不是质数
48 可以被 24 整除 不是质数
48 是质数
49 可以被 7 整除 不是质数
49 是质数
50 可以被 2 整除 不是质数
50 可以被 5 整除 不是质数
50 可以被 10 整除 不是质数
50 可以被 25 整除 不是质数
50 是质数
51 可以被 3 整除 不是质数
51 可以被 17 整除 不是质数
51 是质数
52 可以被 2 整除 不是质数
52 可以被 4 整除 不是质数
52 可以被 13 整除 不是质数
52 可以被 26 整除 不是质数
52 是质数
53 是质数
54 可以被 2 整除 不是质数
54 可以被 3 整除 不是质数
54 可以被 6 整除 不是质数
54 可以被 9 整除 不是质数
54 可以被 18 整除 不是质数
54 可以被 27 整除 不是质数
54 是质数
55 可以被 5 整除 不是质数
55 可以被 11 整除 不是质数
55 是质数
56 可以被 2 整除 不是质数
56 可以被 4 整除 不是质数
56 可以被 7 整除 不是质数
56 可以被 8 整除 不是质数
56 可以被 14 整除 不是质数
56 可以被 28 整除 不是质数
56 是质数
57 可以被 3 整除 不是质数
57 可以被 19 整除 不是质数
57 是质数
58 可以被 2 整除 不是质数
58 可以被 29 整除 不是质数
58 是质数
59 是质数
60 可以被 2 整除 不是质数
60 可以被 3 整除 不是质数
60 可以被 4 整除 不是质数
60 可以被 5 整除 不是质数
60 可以被 6 整除 不是质数
60 可以被 10 整除 不是质数
60 可以被 12 整除 不是质数
60 可以被 15 整除 不是质数
60 可以被 20 整除 不是质数
60 可以被 30 整除 不是质数
60 是质数
61 是质数
62 可以被 2 整除 不是质数
62 可以被 31 整除 不是质数
62 是质数
63 可以被 3 整除 不是质数
63 可以被 7 整除 不是质数
63 可以被 9 整除 不是质数
63 可以被 21 整除 不是质数
63 是质数
64 可以被 2 整除 不是质数
64 可以被 4 整除 不是质数
64 可以被 8 整除 不是质数
64 可以被 16 整除 不是质数
64 可以被 32 整除 不是质数
64 是质数
65 可以被 5 整除 不是质数
65 可以被 13 整除 不是质数
65 是质数
66 可以被 2 整除 不是质数
66 可以被 3 整除 不是质数
66 可以被 6 整除 不是质数
66 可以被 11 整除 不是质数
66 可以被 22 整除 不是质数
66 可以被 33 整除 不是质数
66 是质数
67 是质数
68 可以被 2 整除 不是质数
68 可以被 4 整除 不是质数
68 可以被 17 整除 不是质数
68 可以被 34 整除 不是质数
68 是质数
69 可以被 3 整除 不是质数
69 可以被 23 整除 不是质数
69 是质数
70 可以被 2 整除 不是质数
70 可以被 5 整除 不是质数
70 可以被 7 整除 不是质数
70 可以被 10 整除 不是质数
70 可以被 14 整除 不是质数
70 可以被 35 整除 不是质数
70 是质数
71 是质数
72 可以被 2 整除 不是质数
72 可以被 3 整除 不是质数
72 可以被 4 整除 不是质数
72 可以被 6 整除 不是质数
72 可以被 8 整除 不是质数
72 可以被 9 整除 不是质数
72 可以被 12 整除 不是质数
72 可以被 18 整除 不是质数
72 可以被 24 整除 不是质数
72 可以被 36 整除 不是质数
72 是质数
73 是质数
74 可以被 2 整除 不是质数
74 可以被 37 整除 不是质数
74 是质数
75 可以被 3 整除 不是质数
75 可以被 5 整除 不是质数
75 可以被 15 整除 不是质数
75 可以被 25 整除 不是质数
75 是质数
76 可以被 2 整除 不是质数
76 可以被 4 整除 不是质数
76 可以被 19 整除 不是质数
76 可以被 38 整除 不是质数
76 是质数
77 可以被 7 整除 不是质数
77 可以被 11 整除 不是质数
77 是质数
78 可以被 2 整除 不是质数
78 可以被 3 整除 不是质数
78 可以被 6 整除 不是质数
78 可以被 13 整除 不是质数
78 可以被 26 整除 不是质数
78 可以被 39 整除 不是质数
78 是质数
79 是质数
80 可以被 2 整除 不是质数
80 可以被 4 整除 不是质数
80 可以被 5 整除 不是质数
80 可以被 8 整除 不是质数
80 可以被 10 整除 不是质数
80 可以被 16 整除 不是质数
80 可以被 20 整除 不是质数
80 可以被 40 整除 不是质数
80 是质数
81 可以被 3 整除 不是质数
81 可以被 9 整除 不是质数
81 可以被 27 整除 不是质数
81 是质数
82 可以被 2 整除 不是质数
82 可以被 41 整除 不是质数
82 是质数
83 是质数
84 可以被 2 整除 不是质数
84 可以被 3 整除 不是质数
84 可以被 4 整除 不是质数
84 可以被 6 整除 不是质数
84 可以被 7 整除 不是质数
84 可以被 12 整除 不是质数
84 可以被 14 整除 不是质数
84 可以被 21 整除 不是质数
84 可以被 28 整除 不是质数
84 可以被 42 整除 不是质数
84 是质数
85 可以被 5 整除 不是质数
85 可以被 17 整除 不是质数
85 是质数
86 可以被 2 整除 不是质数
86 可以被 43 整除 不是质数
86 是质数
87 可以被 3 整除 不是质数
87 可以被 29 整除 不是质数
87 是质数
88 可以被 2 整除 不是质数
88 可以被 4 整除 不是质数
88 可以被 8 整除 不是质数
88 可以被 11 整除 不是质数
88 可以被 22 整除 不是质数
88 可以被 44 整除 不是质数
88 是质数
89 是质数
90 可以被 2 整除 不是质数
90 可以被 3 整除 不是质数
90 可以被 5 整除 不是质数
90 可以被 6 整除 不是质数
90 可以被 9 整除 不是质数
90 可以被 10 整除 不是质数
90 可以被 15 整除 不是质数
90 可以被 18 整除 不是质数
90 可以被 30 整除 不是质数
90 可以被 45 整除 不是质数
90 是质数
91 可以被 7 整除 不是质数
91 可以被 13 整除 不是质数
91 是质数
92 可以被 2 整除 不是质数
92 可以被 4 整除 不是质数
92 可以被 23 整除 不是质数
92 可以被 46 整除 不是质数
92 是质数
93 可以被 3 整除 不是质数
93 可以被 31 整除 不是质数
93 是质数
94 可以被 2 整除 不是质数
94 可以被 47 整除 不是质数
94 是质数
95 可以被 5 整除 不是质数
95 可以被 19 整除 不是质数
95 是质数
96 可以被 2 整除 不是质数
96 可以被 3 整除 不是质数
96 可以被 4 整除 不是质数
96 可以被 6 整除 不是质数
96 可以被 8 整除 不是质数
96 可以被 12 整除 不是质数
96 可以被 16 整除 不是质数
96 可以被 24 整除 不是质数
96 可以被 32 整除 不是质数
96 可以被 48 整除 不是质数
96 是质数
97 是质数
98 可以被 2 整除 不是质数
98 可以被 7 整除 不是质数
98 可以被 14 整除 不是质数
98 可以被 49 整除 不是质数
98 是质数
99 可以被 3 整除 不是质数
99 可以被 9 整除 不是质数
99 可以被 11 整除 不是质数
99 可以被 33 整除 不是质数
99 是质数
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
2 是质数
3 是质数
2
4 不是质数,可以被 None 整除
4 是质数
5 是质数
2
6 不是质数,可以被 None 整除
3
6 不是质数,可以被 None 整除
6 是质数
7 是质数
2
8 不是质数,可以被 None 整除
4
8 不是质数,可以被 None 整除
8 是质数
3
9 不是质数,可以被 None 整除
9 是质数
2
10 不是质数,可以被 None 整除
5
10 不是质数,可以被 None 整除
10 是质数
11 是质数
2
12 不是质数,可以被 None 整除
3
12 不是质数,可以被 None 整除
4
12 不是质数,可以被 None 整除
6
12 不是质数,可以被 None 整除
12 是质数
13 是质数
2
14 不是质数,可以被 None 整除
7
14 不是质数,可以被 None 整除
14 是质数
3
15 不是质数,可以被 None 整除
5
15 不是质数,可以被 None 整除
15 是质数
2
16 不是质数,可以被 None 整除
4
16 不是质数,可以被 None 整除
8
16 不是质数,可以被 None 整除
16 是质数
17 是质数
2
18 不是质数,可以被 None 整除
3
18 不是质数,可以被 None 整除
6
18 不是质数,可以被 None 整除
9
18 不是质数,可以被 None 整除
18 是质数
19 是质数
2
20 不是质数,可以被 None 整除
4
20 不是质数,可以被 None 整除
5
20 不是质数,可以被 None 整除
10
20 不是质数,可以被 None 整除
20 是质数
3
21 不是质数,可以被 None 整除
7
21 不是质数,可以被 None 整除
21 是质数
2
22 不是质数,可以被 None 整除
11
22 不是质数,可以被 None 整除
22 是质数
23 是质数
2
24 不是质数,可以被 None 整除
3
24 不是质数,可以被 None 整除
4
24 不是质数,可以被 None 整除
6
24 不是质数,可以被 None 整除
8
24 不是质数,可以被 None 整除
12
24 不是质数,可以被 None 整除
24 是质数
5
25 不是质数,可以被 None 整除
25 是质数
2
26 不是质数,可以被 None 整除
13
26 不是质数,可以被 None 整除
26 是质数
3
27 不是质数,可以被 None 整除
9
27 不是质数,可以被 None 整除
27 是质数
2
28 不是质数,可以被 None 整除
4
28 不是质数,可以被 None 整除
7
28 不是质数,可以被 None 整除
14
28 不是质数,可以被 None 整除
28 是质数
29 是质数
2
30 不是质数,可以被 None 整除
3
30 不是质数,可以被 None 整除
5
30 不是质数,可以被 None 整除
6
30 不是质数,可以被 None 整除
10
30 不是质数,可以被 None 整除
15
30 不是质数,可以被 None 整除
30 是质数
31 是质数
2
32 不是质数,可以被 None 整除
4
32 不是质数,可以被 None 整除
8
32 不是质数,可以被 None 整除
16
32 不是质数,可以被 None 整除
32 是质数
3
33 不是质数,可以被 None 整除
11
33 不是质数,可以被 None 整除
33 是质数
2
34 不是质数,可以被 None 整除
17
34 不是质数,可以被 None 整除
34 是质数
5
35 不是质数,可以被 None 整除
7
35 不是质数,可以被 None 整除
35 是质数
2
36 不是质数,可以被 None 整除
3
36 不是质数,可以被 None 整除
4
36 不是质数,可以被 None 整除
6
36 不是质数,可以被 None 整除
9
36 不是质数,可以被 None 整除
12
36 不是质数,可以被 None 整除
18
36 不是质数,可以被 None 整除
36 是质数
37 是质数
2
38 不是质数,可以被 None 整除
19
38 不是质数,可以被 None 整除
38 是质数
3
39 不是质数,可以被 None 整除
13
39 不是质数,可以被 None 整除
39 是质数
2
40 不是质数,可以被 None 整除
4
40 不是质数,可以被 None 整除
5
40 不是质数,可以被 None 整除
8
40 不是质数,可以被 None 整除
10
40 不是质数,可以被 None 整除
20
40 不是质数,可以被 None 整除
40 是质数
41 是质数
2
42 不是质数,可以被 None 整除
3
42 不是质数,可以被 None 整除
6
42 不是质数,可以被 None 整除
7
42 不是质数,可以被 None 整除
14
42 不是质数,可以被 None 整除
21
42 不是质数,可以被 None 整除
42 是质数
43 是质数
2
44 不是质数,可以被 None 整除
4
44 不是质数,可以被 None 整除
11
44 不是质数,可以被 None 整除
22
44 不是质数,可以被 None 整除
44 是质数
3
45 不是质数,可以被 None 整除
5
45 不是质数,可以被 None 整除
9
45 不是质数,可以被 None 整除
15
45 不是质数,可以被 None 整除
45 是质数
2
46 不是质数,可以被 None 整除
23
46 不是质数,可以被 None 整除
46 是质数
47 是质数
2
48 不是质数,可以被 None 整除
3
48 不是质数,可以被 None 整除
4
48 不是质数,可以被 None 整除
6
48 不是质数,可以被 None 整除
8
48 不是质数,可以被 None 整除
12
48 不是质数,可以被 None 整除
16
48 不是质数,可以被 None 整除
24
48 不是质数,可以被 None 整除
48 是质数
7
49 不是质数,可以被 None 整除
49 是质数
2
50 不是质数,可以被 None 整除
5
50 不是质数,可以被 None 整除
10
50 不是质数,可以被 None 整除
25
50 不是质数,可以被 None 整除
50 是质数
3
51 不是质数,可以被 None 整除
17
51 不是质数,可以被 None 整除
51 是质数
2
52 不是质数,可以被 None 整除
4
52 不是质数,可以被 None 整除
13
52 不是质数,可以被 None 整除
26
52 不是质数,可以被 None 整除
52 是质数
53 是质数
2
54 不是质数,可以被 None 整除
3
54 不是质数,可以被 None 整除
6
54 不是质数,可以被 None 整除
9
54 不是质数,可以被 None 整除
18
54 不是质数,可以被 None 整除
27
54 不是质数,可以被 None 整除
54 是质数
5
55 不是质数,可以被 None 整除
11
55 不是质数,可以被 None 整除
55 是质数
2
56 不是质数,可以被 None 整除
4
56 不是质数,可以被 None 整除
7
56 不是质数,可以被 None 整除
8
56 不是质数,可以被 None 整除
14
56 不是质数,可以被 None 整除
28
56 不是质数,可以被 None 整除
56 是质数
3
57 不是质数,可以被 None 整除
19
57 不是质数,可以被 None 整除
57 是质数
2
58 不是质数,可以被 None 整除
29
58 不是质数,可以被 None 整除
58 是质数
59 是质数
2
60 不是质数,可以被 None 整除
3
60 不是质数,可以被 None 整除
4
60 不是质数,可以被 None 整除
5
60 不是质数,可以被 None 整除
6
60 不是质数,可以被 None 整除
10
60 不是质数,可以被 None 整除
12
60 不是质数,可以被 None 整除
15
60 不是质数,可以被 None 整除
20
60 不是质数,可以被 None 整除
30
60 不是质数,可以被 None 整除
60 是质数
61 是质数
2
62 不是质数,可以被 None 整除
31
62 不是质数,可以被 None 整除
62 是质数
3
63 不是质数,可以被 None 整除
7
63 不是质数,可以被 None 整除
9
63 不是质数,可以被 None 整除
21
63 不是质数,可以被 None 整除
63 是质数
2
64 不是质数,可以被 None 整除
4
64 不是质数,可以被 None 整除
8
64 不是质数,可以被 None 整除
16
64 不是质数,可以被 None 整除
32
64 不是质数,可以被 None 整除
64 是质数
5
65 不是质数,可以被 None 整除
13
65 不是质数,可以被 None 整除
65 是质数
2
66 不是质数,可以被 None 整除
3
66 不是质数,可以被 None 整除
6
66 不是质数,可以被 None 整除
11
66 不是质数,可以被 None 整除
22
66 不是质数,可以被 None 整除
33
66 不是质数,可以被 None 整除
66 是质数
67 是质数
2
68 不是质数,可以被 None 整除
4
68 不是质数,可以被 None 整除
17
68 不是质数,可以被 None 整除
34
68 不是质数,可以被 None 整除
68 是质数
3
69 不是质数,可以被 None 整除
23
69 不是质数,可以被 None 整除
69 是质数
2
70 不是质数,可以被 None 整除
5
70 不是质数,可以被 None 整除
7
70 不是质数,可以被 None 整除
10
70 不是质数,可以被 None 整除
14
70 不是质数,可以被 None 整除
35
70 不是质数,可以被 None 整除
70 是质数
71 是质数
2
72 不是质数,可以被 None 整除
3
72 不是质数,可以被 None 整除
4
72 不是质数,可以被 None 整除
6
72 不是质数,可以被 None 整除
8
72 不是质数,可以被 None 整除
9
72 不是质数,可以被 None 整除
12
72 不是质数,可以被 None 整除
18
72 不是质数,可以被 None 整除
24
72 不是质数,可以被 None 整除
36
72 不是质数,可以被 None 整除
72 是质数
73 是质数
2
74 不是质数,可以被 None 整除
37
74 不是质数,可以被 None 整除
74 是质数
3
75 不是质数,可以被 None 整除
5
75 不是质数,可以被 None 整除
15
75 不是质数,可以被 None 整除
25
75 不是质数,可以被 None 整除
75 是质数
2
76 不是质数,可以被 None 整除
4
76 不是质数,可以被 None 整除
19
76 不是质数,可以被 None 整除
38
76 不是质数,可以被 None 整除
76 是质数
7
77 不是质数,可以被 None 整除
11
77 不是质数,可以被 None 整除
77 是质数
2
78 不是质数,可以被 None 整除
3
78 不是质数,可以被 None 整除
6
78 不是质数,可以被 None 整除
13
78 不是质数,可以被 None 整除
26
78 不是质数,可以被 None 整除
39
78 不是质数,可以被 None 整除
78 是质数
79 是质数
2
80 不是质数,可以被 None 整除
4
80 不是质数,可以被 None 整除
5
80 不是质数,可以被 None 整除
8
80 不是质数,可以被 None 整除
10
80 不是质数,可以被 None 整除
16
80 不是质数,可以被 None 整除
20
80 不是质数,可以被 None 整除
40
80 不是质数,可以被 None 整除
80 是质数
3
81 不是质数,可以被 None 整除
9
81 不是质数,可以被 None 整除
27
81 不是质数,可以被 None 整除
81 是质数
2
82 不是质数,可以被 None 整除
41
82 不是质数,可以被 None 整除
82 是质数
83 是质数
2
84 不是质数,可以被 None 整除
3
84 不是质数,可以被 None 整除
4
84 不是质数,可以被 None 整除
6
84 不是质数,可以被 None 整除
7
84 不是质数,可以被 None 整除
12
84 不是质数,可以被 None 整除
14
84 不是质数,可以被 None 整除
21
84 不是质数,可以被 None 整除
28
84 不是质数,可以被 None 整除
42
84 不是质数,可以被 None 整除
84 是质数
5
85 不是质数,可以被 None 整除
17
85 不是质数,可以被 None 整除
85 是质数
2
86 不是质数,可以被 None 整除
43
86 不是质数,可以被 None 整除
86 是质数
3
87 不是质数,可以被 None 整除
29
87 不是质数,可以被 None 整除
87 是质数
2
88 不是质数,可以被 None 整除
4
88 不是质数,可以被 None 整除
8
88 不是质数,可以被 None 整除
11
88 不是质数,可以被 None 整除
22
88 不是质数,可以被 None 整除
44
88 不是质数,可以被 None 整除
88 是质数
89 是质数
2
90 不是质数,可以被 None 整除
3
90 不是质数,可以被 None 整除
5
90 不是质数,可以被 None 整除
6
90 不是质数,可以被 None 整除
9
90 不是质数,可以被 None 整除
10
90 不是质数,可以被 None 整除
15
90 不是质数,可以被 None 整除
18
90 不是质数,可以被 None 整除
30
90 不是质数,可以被 None 整除
45
90 不是质数,可以被 None 整除
90 是质数
7
91 不是质数,可以被 None 整除
13
91 不是质数,可以被 None 整除
91 是质数
2
92 不是质数,可以被 None 整除
4
92 不是质数,可以被 None 整除
23
92 不是质数,可以被 None 整除
46
92 不是质数,可以被 None 整除
92 是质数
3
93 不是质数,可以被 None 整除
31
93 不是质数,可以被 None 整除
93 是质数
2
94 不是质数,可以被 None 整除
47
94 不是质数,可以被 None 整除
94 是质数
5
95 不是质数,可以被 None 整除
19
95 不是质数,可以被 None 整除
95 是质数
2
96 不是质数,可以被 None 整除
3
96 不是质数,可以被 None 整除
4
96 不是质数,可以被 None 整除
6
96 不是质数,可以被 None 整除
8
96 不是质数,可以被 None 整除
12
96 不是质数,可以被 None 整除
16
96 不是质数,可以被 None 整除
24
96 不是质数,可以被 None 整除
32
96 不是质数,可以被 None 整除
48
96 不是质数,可以被 None 整除
96 是质数
97 是质数
2
98 不是质数,可以被 None 整除
7
98 不是质数,可以被 None 整除
14
98 不是质数,可以被 None 整除
49
98 不是质数,可以被 None 整除
98 是质数
3
99 不是质数,可以被 None 整除
9
99 不是质数,可以被 None 整除
11
99 不是质数,可以被 None 整除
33
99 不是质数,可以被 None 整除
99 是质数
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
2 是质数
3 是质数
2
4 不是质数,可以被 None 整除
4 是质数
5 是质数
2
6 不是质数,可以被 None 整除
3
6 不是质数,可以被 None 整除
6 是质数
7 是质数
2
8 不是质数,可以被 None 整除
4
8 不是质数,可以被 None 整除
8 是质数
3
9 不是质数,可以被 None 整除
9 是质数
2
10 不是质数,可以被 None 整除
5
10 不是质数,可以被 None 整除
10 是质数
11 是质数
2
12 不是质数,可以被 None 整除
3
12 不是质数,可以被 None 整除
4
12 不是质数,可以被 None 整除
6
12 不是质数,可以被 None 整除
12 是质数
13 是质数
2
14 不是质数,可以被 None 整除
7
14 不是质数,可以被 None 整除
14 是质数
3
15 不是质数,可以被 None 整除
5
15 不是质数,可以被 None 整除
15 是质数
2
16 不是质数,可以被 None 整除
4
16 不是质数,可以被 None 整除
8
16 不是质数,可以被 None 整除
16 是质数
17 是质数
2
18 不是质数,可以被 None 整除
3
18 不是质数,可以被 None 整除
6
18 不是质数,可以被 None 整除
9
18 不是质数,可以被 None 整除
18 是质数
19 是质数
2
20 不是质数,可以被 None 整除
4
20 不是质数,可以被 None 整除
5
20 不是质数,可以被 None 整除
10
20 不是质数,可以被 None 整除
20 是质数
3
21 不是质数,可以被 None 整除
7
21 不是质数,可以被 None 整除
21 是质数
2
22 不是质数,可以被 None 整除
11
22 不是质数,可以被 None 整除
22 是质数
23 是质数
2
24 不是质数,可以被 None 整除
3
24 不是质数,可以被 None 整除
4
24 不是质数,可以被 None 整除
6
24 不是质数,可以被 None 整除
8
24 不是质数,可以被 None 整除
12
24 不是质数,可以被 None 整除
24 是质数
5
25 不是质数,可以被 None 整除
25 是质数
2
26 不是质数,可以被 None 整除
13
26 不是质数,可以被 None 整除
26 是质数
3
27 不是质数,可以被 None 整除
9
27 不是质数,可以被 None 整除
27 是质数
2
28 不是质数,可以被 None 整除
4
28 不是质数,可以被 None 整除
7
28 不是质数,可以被 None 整除
14
28 不是质数,可以被 None 整除
28 是质数
29 是质数
2
30 不是质数,可以被 None 整除
3
30 不是质数,可以被 None 整除
5
30 不是质数,可以被 None 整除
6
30 不是质数,可以被 None 整除
10
30 不是质数,可以被 None 整除
15
30 不是质数,可以被 None 整除
30 是质数
31 是质数
2
32 不是质数,可以被 None 整除
4
32 不是质数,可以被 None 整除
8
32 不是质数,可以被 None 整除
16
32 不是质数,可以被 None 整除
32 是质数
3
33 不是质数,可以被 None 整除
11
33 不是质数,可以被 None 整除
33 是质数
2
34 不是质数,可以被 None 整除
17
34 不是质数,可以被 None 整除
34 是质数
5
35 不是质数,可以被 None 整除
7
35 不是质数,可以被 None 整除
35 是质数
2
36 不是质数,可以被 None 整除
3
36 不是质数,可以被 None 整除
4
36 不是质数,可以被 None 整除
6
36 不是质数,可以被 None 整除
9
36 不是质数,可以被 None 整除
12
36 不是质数,可以被 None 整除
18
36 不是质数,可以被 None 整除
36 是质数
37 是质数
2
38 不是质数,可以被 None 整除
19
38 不是质数,可以被 None 整除
38 是质数
3
39 不是质数,可以被 None 整除
13
39 不是质数,可以被 None 整除
39 是质数
2
40 不是质数,可以被 None 整除
4
40 不是质数,可以被 None 整除
5
40 不是质数,可以被 None 整除
8
40 不是质数,可以被 None 整除
10
40 不是质数,可以被 None 整除
20
40 不是质数,可以被 None 整除
40 是质数
41 是质数
2
42 不是质数,可以被 None 整除
3
42 不是质数,可以被 None 整除
6
42 不是质数,可以被 None 整除
7
42 不是质数,可以被 None 整除
14
42 不是质数,可以被 None 整除
21
42 不是质数,可以被 None 整除
42 是质数
43 是质数
2
44 不是质数,可以被 None 整除
4
44 不是质数,可以被 None 整除
11
44 不是质数,可以被 None 整除
22
44 不是质数,可以被 None 整除
44 是质数
3
45 不是质数,可以被 None 整除
5
45 不是质数,可以被 None 整除
9
45 不是质数,可以被 None 整除
15
45 不是质数,可以被 None 整除
45 是质数
2
46 不是质数,可以被 None 整除
23
46 不是质数,可以被 None 整除
46 是质数
47 是质数
2
48 不是质数,可以被 None 整除
3
48 不是质数,可以被 None 整除
4
48 不是质数,可以被 None 整除
6
48 不是质数,可以被 None 整除
8
48 不是质数,可以被 None 整除
12
48 不是质数,可以被 None 整除
16
48 不是质数,可以被 None 整除
24
48 不是质数,可以被 None 整除
48 是质数
7
49 不是质数,可以被 None 整除
49 是质数
2
50 不是质数,可以被 None 整除
5
50 不是质数,可以被 None 整除
10
50 不是质数,可以被 None 整除
25
50 不是质数,可以被 None 整除
50 是质数
3
51 不是质数,可以被 None 整除
17
51 不是质数,可以被 None 整除
51 是质数
2
52 不是质数,可以被 None 整除
4
52 不是质数,可以被 None 整除
13
52 不是质数,可以被 None 整除
26
52 不是质数,可以被 None 整除
52 是质数
53 是质数
2
54 不是质数,可以被 None 整除
3
54 不是质数,可以被 None 整除
6
54 不是质数,可以被 None 整除
9
54 不是质数,可以被 None 整除
18
54 不是质数,可以被 None 整除
27
54 不是质数,可以被 None 整除
54 是质数
5
55 不是质数,可以被 None 整除
11
55 不是质数,可以被 None 整除
55 是质数
2
56 不是质数,可以被 None 整除
4
56 不是质数,可以被 None 整除
7
56 不是质数,可以被 None 整除
8
56 不是质数,可以被 None 整除
14
56 不是质数,可以被 None 整除
28
56 不是质数,可以被 None 整除
56 是质数
3
57 不是质数,可以被 None 整除
19
57 不是质数,可以被 None 整除
57 是质数
2
58 不是质数,可以被 None 整除
29
58 不是质数,可以被 None 整除
58 是质数
59 是质数
2
60 不是质数,可以被 None 整除
3
60 不是质数,可以被 None 整除
4
60 不是质数,可以被 None 整除
5
60 不是质数,可以被 None 整除
6
60 不是质数,可以被 None 整除
10
60 不是质数,可以被 None 整除
12
60 不是质数,可以被 None 整除
15
60 不是质数,可以被 None 整除
20
60 不是质数,可以被 None 整除
30
60 不是质数,可以被 None 整除
60 是质数
61 是质数
2
62 不是质数,可以被 None 整除
31
62 不是质数,可以被 None 整除
62 是质数
3
63 不是质数,可以被 None 整除
7
63 不是质数,可以被 None 整除
9
63 不是质数,可以被 None 整除
21
63 不是质数,可以被 None 整除
63 是质数
2
64 不是质数,可以被 None 整除
4
64 不是质数,可以被 None 整除
8
64 不是质数,可以被 None 整除
16
64 不是质数,可以被 None 整除
32
64 不是质数,可以被 None 整除
64 是质数
5
65 不是质数,可以被 None 整除
13
65 不是质数,可以被 None 整除
65 是质数
2
66 不是质数,可以被 None 整除
3
66 不是质数,可以被 None 整除
6
66 不是质数,可以被 None 整除
11
66 不是质数,可以被 None 整除
22
66 不是质数,可以被 None 整除
33
66 不是质数,可以被 None 整除
66 是质数
67 是质数
2
68 不是质数,可以被 None 整除
4
68 不是质数,可以被 None 整除
17
68 不是质数,可以被 None 整除
34
68 不是质数,可以被 None 整除
68 是质数
3
69 不是质数,可以被 None 整除
23
69 不是质数,可以被 None 整除
69 是质数
2
70 不是质数,可以被 None 整除
5
70 不是质数,可以被 None 整除
7
70 不是质数,可以被 None 整除
10
70 不是质数,可以被 None 整除
14
70 不是质数,可以被 None 整除
35
70 不是质数,可以被 None 整除
70 是质数
71 是质数
2
72 不是质数,可以被 None 整除
3
72 不是质数,可以被 None 整除
4
72 不是质数,可以被 None 整除
6
72 不是质数,可以被 None 整除
8
72 不是质数,可以被 None 整除
9
72 不是质数,可以被 None 整除
12
72 不是质数,可以被 None 整除
18
72 不是质数,可以被 None 整除
24
72 不是质数,可以被 None 整除
36
72 不是质数,可以被 None 整除
72 是质数
73 是质数
2
74 不是质数,可以被 None 整除
37
74 不是质数,可以被 None 整除
74 是质数
3
75 不是质数,可以被 None 整除
5
75 不是质数,可以被 None 整除
15
75 不是质数,可以被 None 整除
25
75 不是质数,可以被 None 整除
75 是质数
2
76 不是质数,可以被 None 整除
4
76 不是质数,可以被 None 整除
19
76 不是质数,可以被 None 整除
38
76 不是质数,可以被 None 整除
76 是质数
7
77 不是质数,可以被 None 整除
11
77 不是质数,可以被 None 整除
77 是质数
2
78 不是质数,可以被 None 整除
3
78 不是质数,可以被 None 整除
6
78 不是质数,可以被 None 整除
13
78 不是质数,可以被 None 整除
26
78 不是质数,可以被 None 整除
39
78 不是质数,可以被 None 整除
78 是质数
79 是质数
2
80 不是质数,可以被 None 整除
4
80 不是质数,可以被 None 整除
5
80 不是质数,可以被 None 整除
8
80 不是质数,可以被 None 整除
10
80 不是质数,可以被 None 整除
16
80 不是质数,可以被 None 整除
20
80 不是质数,可以被 None 整除
40
80 不是质数,可以被 None 整除
80 是质数
3
81 不是质数,可以被 None 整除
9
81 不是质数,可以被 None 整除
27
81 不是质数,可以被 None 整除
81 是质数
2
82 不是质数,可以被 None 整除
41
82 不是质数,可以被 None 整除
82 是质数
83 是质数
2
84 不是质数,可以被 None 整除
3
84 不是质数,可以被 None 整除
4
84 不是质数,可以被 None 整除
6
84 不是质数,可以被 None 整除
7
84 不是质数,可以被 None 整除
12
84 不是质数,可以被 None 整除
14
84 不是质数,可以被 None 整除
21
84 不是质数,可以被 None 整除
28
84 不是质数,可以被 None 整除
42
84 不是质数,可以被 None 整除
84 是质数
5
85 不是质数,可以被 None 整除
17
85 不是质数,可以被 None 整除
85 是质数
2
86 不是质数,可以被 None 整除
43
86 不是质数,可以被 None 整除
86 是质数
3
87 不是质数,可以被 None 整除
29
87 不是质数,可以被 None 整除
87 是质数
2
88 不是质数,可以被 None 整除
4
88 不是质数,可以被 None 整除
8
88 不是质数,可以被 None 整除
11
88 不是质数,可以被 None 整除
22
88 不是质数,可以被 None 整除
44
88 不是质数,可以被 None 整除
88 是质数
89 是质数
2
90 不是质数,可以被 None 整除
3
90 不是质数,可以被 None 整除
5
90 不是质数,可以被 None 整除
6
90 不是质数,可以被 None 整除
9
90 不是质数,可以被 None 整除
10
90 不是质数,可以被 None 整除
15
90 不是质数,可以被 None 整除
18
90 不是质数,可以被 None 整除
30
90 不是质数,可以被 None 整除
45
90 不是质数,可以被 None 整除
90 是质数
7
91 不是质数,可以被 None 整除
13
91 不是质数,可以被 None 整除
91 是质数
2
92 不是质数,可以被 None 整除
4
92 不是质数,可以被 None 整除
23
92 不是质数,可以被 None 整除
46
92 不是质数,可以被 None 整除
92 是质数
3
93 不是质数,可以被 None 整除
31
93 不是质数,可以被 None 整除
93 是质数
2
94 不是质数,可以被 None 整除
47
94 不是质数,可以被 None 整除
94 是质数
5
95 不是质数,可以被 None 整除
19
95 不是质数,可以被 None 整除
95 是质数
2
96 不是质数,可以被 None 整除
3
96 不是质数,可以被 None 整除
4
96 不是质数,可以被 None 整除
6
96 不是质数,可以被 None 整除
8
96 不是质数,可以被 None 整除
12
96 不是质数,可以被 None 整除
16
96 不是质数,可以被 None 整除
24
96 不是质数,可以被 None 整除
32
96 不是质数,可以被 None 整除
48
96 不是质数,可以被 None 整除
96 是质数
97 是质数
2
98 不是质数,可以被 None 整除
7
98 不是质数,可以被 None 整除
14
98 不是质数,可以被 None 整除
49
98 不是质数,可以被 None 整除
98 是质数
3
99 不是质数,可以被 None 整除
9
99 不是质数,可以被 None 整除
11
99 不是质数,可以被 None 整除
33
99 不是质数,可以被 None 整除
99 是质数
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
2 是质数
3 是质数
2
4 不是质数,可以被 None 整除
4 是质数
5 是质数
2
6 不是质数,可以被 None 整除
3
6 不是质数,可以被 None 整除
6 是质数
7 是质数
2
8 不是质数,可以被 None 整除
4
8 不是质数,可以被 None 整除
8 是质数
3
9 不是质数,可以被 None 整除
9 是质数
2
10 不是质数,可以被 None 整除
5
10 不是质数,可以被 None 整除
10 是质数
11 是质数
2
12 不是质数,可以被 None 整除
3
12 不是质数,可以被 None 整除
4
12 不是质数,可以被 None 整除
6
12 不是质数,可以被 None 整除
12 是质数
13 是质数
2
14 不是质数,可以被 None 整除
7
14 不是质数,可以被 None 整除
14 是质数
3
15 不是质数,可以被 None 整除
5
15 不是质数,可以被 None 整除
15 是质数
2
16 不是质数,可以被 None 整除
4
16 不是质数,可以被 None 整除
8
16 不是质数,可以被 None 整除
16 是质数
17 是质数
2
18 不是质数,可以被 None 整除
3
18 不是质数,可以被 None 整除
6
18 不是质数,可以被 None 整除
9
18 不是质数,可以被 None 整除
18 是质数
19 是质数
2
20 不是质数,可以被 None 整除
4
20 不是质数,可以被 None 整除
5
20 不是质数,可以被 None 整除
10
20 不是质数,可以被 None 整除
20 是质数
3
21 不是质数,可以被 None 整除
7
21 不是质数,可以被 None 整除
21 是质数
2
22 不是质数,可以被 None 整除
11
22 不是质数,可以被 None 整除
22 是质数
23 是质数
2
24 不是质数,可以被 None 整除
3
24 不是质数,可以被 None 整除
4
24 不是质数,可以被 None 整除
6
24 不是质数,可以被 None 整除
8
24 不是质数,可以被 None 整除
12
24 不是质数,可以被 None 整除
24 是质数
5
25 不是质数,可以被 None 整除
25 是质数
2
26 不是质数,可以被 None 整除
13
26 不是质数,可以被 None 整除
26 是质数
3
27 不是质数,可以被 None 整除
9
27 不是质数,可以被 None 整除
27 是质数
2
28 不是质数,可以被 None 整除
4
28 不是质数,可以被 None 整除
7
28 不是质数,可以被 None 整除
14
28 不是质数,可以被 None 整除
28 是质数
29 是质数
2
30 不是质数,可以被 None 整除
3
30 不是质数,可以被 None 整除
5
30 不是质数,可以被 None 整除
6
30 不是质数,可以被 None 整除
10
30 不是质数,可以被 None 整除
15
30 不是质数,可以被 None 整除
30 是质数
31 是质数
2
32 不是质数,可以被 None 整除
4
32 不是质数,可以被 None 整除
8
32 不是质数,可以被 None 整除
16
32 不是质数,可以被 None 整除
32 是质数
3
33 不是质数,可以被 None 整除
11
33 不是质数,可以被 None 整除
33 是质数
2
34 不是质数,可以被 None 整除
17
34 不是质数,可以被 None 整除
34 是质数
5
35 不是质数,可以被 None 整除
7
35 不是质数,可以被 None 整除
35 是质数
2
36 不是质数,可以被 None 整除
3
36 不是质数,可以被 None 整除
4
36 不是质数,可以被 None 整除
6
36 不是质数,可以被 None 整除
9
36 不是质数,可以被 None 整除
12
36 不是质数,可以被 None 整除
18
36 不是质数,可以被 None 整除
36 是质数
37 是质数
2
38 不是质数,可以被 None 整除
19
38 不是质数,可以被 None 整除
38 是质数
3
39 不是质数,可以被 None 整除
13
39 不是质数,可以被 None 整除
39 是质数
2
40 不是质数,可以被 None 整除
4
40 不是质数,可以被 None 整除
5
40 不是质数,可以被 None 整除
8
40 不是质数,可以被 None 整除
10
40 不是质数,可以被 None 整除
20
40 不是质数,可以被 None 整除
40 是质数
41 是质数
2
42 不是质数,可以被 None 整除
3
42 不是质数,可以被 None 整除
6
42 不是质数,可以被 None 整除
7
42 不是质数,可以被 None 整除
14
42 不是质数,可以被 None 整除
21
42 不是质数,可以被 None 整除
42 是质数
43 是质数
2
44 不是质数,可以被 None 整除
4
44 不是质数,可以被 None 整除
11
44 不是质数,可以被 None 整除
22
44 不是质数,可以被 None 整除
44 是质数
3
45 不是质数,可以被 None 整除
5
45 不是质数,可以被 None 整除
9
45 不是质数,可以被 None 整除
15
45 不是质数,可以被 None 整除
45 是质数
2
46 不是质数,可以被 None 整除
23
46 不是质数,可以被 None 整除
46 是质数
47 是质数
2
48 不是质数,可以被 None 整除
3
48 不是质数,可以被 None 整除
4
48 不是质数,可以被 None 整除
6
48 不是质数,可以被 None 整除
8
48 不是质数,可以被 None 整除
12
48 不是质数,可以被 None 整除
16
48 不是质数,可以被 None 整除
24
48 不是质数,可以被 None 整除
48 是质数
7
49 不是质数,可以被 None 整除
49 是质数
2
50 不是质数,可以被 None 整除
5
50 不是质数,可以被 None 整除
10
50 不是质数,可以被 None 整除
25
50 不是质数,可以被 None 整除
50 是质数
3
51 不是质数,可以被 None 整除
17
51 不是质数,可以被 None 整除
51 是质数
2
52 不是质数,可以被 None 整除
4
52 不是质数,可以被 None 整除
13
52 不是质数,可以被 None 整除
26
52 不是质数,可以被 None 整除
52 是质数
53 是质数
2
54 不是质数,可以被 None 整除
3
54 不是质数,可以被 None 整除
6
54 不是质数,可以被 None 整除
9
54 不是质数,可以被 None 整除
18
54 不是质数,可以被 None 整除
27
54 不是质数,可以被 None 整除
54 是质数
5
55 不是质数,可以被 None 整除
11
55 不是质数,可以被 None 整除
55 是质数
2
56 不是质数,可以被 None 整除
4
56 不是质数,可以被 None 整除
7
56 不是质数,可以被 None 整除
8
56 不是质数,可以被 None 整除
14
56 不是质数,可以被 None 整除
28
56 不是质数,可以被 None 整除
56 是质数
3
57 不是质数,可以被 None 整除
19
57 不是质数,可以被 None 整除
57 是质数
2
58 不是质数,可以被 None 整除
29
58 不是质数,可以被 None 整除
58 是质数
59 是质数
2
60 不是质数,可以被 None 整除
3
60 不是质数,可以被 None 整除
4
60 不是质数,可以被 None 整除
5
60 不是质数,可以被 None 整除
6
60 不是质数,可以被 None 整除
10
60 不是质数,可以被 None 整除
12
60 不是质数,可以被 None 整除
15
60 不是质数,可以被 None 整除
20
60 不是质数,可以被 None 整除
30
60 不是质数,可以被 None 整除
60 是质数
61 是质数
2
62 不是质数,可以被 None 整除
31
62 不是质数,可以被 None 整除
62 是质数
3
63 不是质数,可以被 None 整除
7
63 不是质数,可以被 None 整除
9
63 不是质数,可以被 None 整除
21
63 不是质数,可以被 None 整除
63 是质数
2
64 不是质数,可以被 None 整除
4
64 不是质数,可以被 None 整除
8
64 不是质数,可以被 None 整除
16
64 不是质数,可以被 None 整除
32
64 不是质数,可以被 None 整除
64 是质数
5
65 不是质数,可以被 None 整除
13
65 不是质数,可以被 None 整除
65 是质数
2
66 不是质数,可以被 None 整除
3
66 不是质数,可以被 None 整除
6
66 不是质数,可以被 None 整除
11
66 不是质数,可以被 None 整除
22
66 不是质数,可以被 None 整除
33
66 不是质数,可以被 None 整除
66 是质数
67 是质数
2
68 不是质数,可以被 None 整除
4
68 不是质数,可以被 None 整除
17
68 不是质数,可以被 None 整除
34
68 不是质数,可以被 None 整除
68 是质数
3
69 不是质数,可以被 None 整除
23
69 不是质数,可以被 None 整除
69 是质数
2
70 不是质数,可以被 None 整除
5
70 不是质数,可以被 None 整除
7
70 不是质数,可以被 None 整除
10
70 不是质数,可以被 None 整除
14
70 不是质数,可以被 None 整除
35
70 不是质数,可以被 None 整除
70 是质数
71 是质数
2
72 不是质数,可以被 None 整除
3
72 不是质数,可以被 None 整除
4
72 不是质数,可以被 None 整除
6
72 不是质数,可以被 None 整除
8
72 不是质数,可以被 None 整除
9
72 不是质数,可以被 None 整除
12
72 不是质数,可以被 None 整除
18
72 不是质数,可以被 None 整除
24
72 不是质数,可以被 None 整除
36
72 不是质数,可以被 None 整除
72 是质数
73 是质数
2
74 不是质数,可以被 None 整除
37
74 不是质数,可以被 None 整除
74 是质数
3
75 不是质数,可以被 None 整除
5
75 不是质数,可以被 None 整除
15
75 不是质数,可以被 None 整除
25
75 不是质数,可以被 None 整除
75 是质数
2
76 不是质数,可以被 None 整除
4
76 不是质数,可以被 None 整除
19
76 不是质数,可以被 None 整除
38
76 不是质数,可以被 None 整除
76 是质数
7
77 不是质数,可以被 None 整除
11
77 不是质数,可以被 None 整除
77 是质数
2
78 不是质数,可以被 None 整除
3
78 不是质数,可以被 None 整除
6
78 不是质数,可以被 None 整除
13
78 不是质数,可以被 None 整除
26
78 不是质数,可以被 None 整除
39
78 不是质数,可以被 None 整除
78 是质数
79 是质数
2
80 不是质数,可以被 None 整除
4
80 不是质数,可以被 None 整除
5
80 不是质数,可以被 None 整除
8
80 不是质数,可以被 None 整除
10
80 不是质数,可以被 None 整除
16
80 不是质数,可以被 None 整除
20
80 不是质数,可以被 None 整除
40
80 不是质数,可以被 None 整除
80 是质数
3
81 不是质数,可以被 None 整除
9
81 不是质数,可以被 None 整除
27
81 不是质数,可以被 None 整除
81 是质数
2
82 不是质数,可以被 None 整除
41
82 不是质数,可以被 None 整除
82 是质数
83 是质数
2
84 不是质数,可以被 None 整除
3
84 不是质数,可以被 None 整除
4
84 不是质数,可以被 None 整除
6
84 不是质数,可以被 None 整除
7
84 不是质数,可以被 None 整除
12
84 不是质数,可以被 None 整除
14
84 不是质数,可以被 None 整除
21
84 不是质数,可以被 None 整除
28
84 不是质数,可以被 None 整除
42
84 不是质数,可以被 None 整除
84 是质数
5
85 不是质数,可以被 None 整除
17
85 不是质数,可以被 None 整除
85 是质数
2
86 不是质数,可以被 None 整除
43
86 不是质数,可以被 None 整除
86 是质数
3
87 不是质数,可以被 None 整除
29
87 不是质数,可以被 None 整除
87 是质数
2
88 不是质数,可以被 None 整除
4
88 不是质数,可以被 None 整除
8
88 不是质数,可以被 None 整除
11
88 不是质数,可以被 None 整除
22
88 不是质数,可以被 None 整除
44
88 不是质数,可以被 None 整除
88 是质数
89 是质数
2
90 不是质数,可以被 None 整除
3
90 不是质数,可以被 None 整除
5
90 不是质数,可以被 None 整除
6
90 不是质数,可以被 None 整除
9
90 不是质数,可以被 None 整除
10
90 不是质数,可以被 None 整除
15
90 不是质数,可以被 None 整除
18
90 不是质数,可以被 None 整除
30
90 不是质数,可以被 None 整除
45
90 不是质数,可以被 None 整除
90 是质数
7
91 不是质数,可以被 None 整除
13
91 不是质数,可以被 None 整除
91 是质数
2
92 不是质数,可以被 None 整除
4
92 不是质数,可以被 None 整除
23
92 不是质数,可以被 None 整除
46
92 不是质数,可以被 None 整除
92 是质数
3
93 不是质数,可以被 None 整除
31
93 不是质数,可以被 None 整除
93 是质数
2
94 不是质数,可以被 None 整除
47
94 不是质数,可以被 None 整除
94 是质数
5
95 不是质数,可以被 None 整除
19
95 不是质数,可以被 None 整除
95 是质数
2
96 不是质数,可以被 None 整除
3
96 不是质数,可以被 None 整除
4
96 不是质数,可以被 None 整除
6
96 不是质数,可以被 None 整除
8
96 不是质数,可以被 None 整除
12
96 不是质数,可以被 None 整除
16
96 不是质数,可以被 None 整除
24
96 不是质数,可以被 None 整除
32
96 不是质数,可以被 None 整除
48
96 不是质数,可以被 None 整除
96 是质数
97 是质数
2
98 不是质数,可以被 None 整除
7
98 不是质数,可以被 None 整除
14
98 不是质数,可以被 None 整除
49
98 不是质数,可以被 None 整除
98 是质数
3
99 不是质数,可以被 None 整除
9
99 不是质数,可以被 None 整除
11
99 不是质数,可以被 None 整除
33
99 不是质数,可以被 None 整除
99 是质数
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
2 是质数
3 是质数
4 不是质数,可以被 2 整除
4 是质数
5 是质数
6 不是质数,可以被 2 整除
6 不是质数,可以被 3 整除
6 是质数
7 是质数
8 不是质数,可以被 2 整除
8 不是质数,可以被 4 整除
8 是质数
9 不是质数,可以被 3 整除
9 是质数
10 不是质数,可以被 2 整除
10 不是质数,可以被 5 整除
10 是质数
11 是质数
12 不是质数,可以被 2 整除
12 不是质数,可以被 3 整除
12 不是质数,可以被 4 整除
12 不是质数,可以被 6 整除
12 是质数
13 是质数
14 不是质数,可以被 2 整除
14 不是质数,可以被 7 整除
14 是质数
15 不是质数,可以被 3 整除
15 不是质数,可以被 5 整除
15 是质数
16 不是质数,可以被 2 整除
16 不是质数,可以被 4 整除
16 不是质数,可以被 8 整除
16 是质数
17 是质数
18 不是质数,可以被 2 整除
18 不是质数,可以被 3 整除
18 不是质数,可以被 6 整除
18 不是质数,可以被 9 整除
18 是质数
19 是质数
20 不是质数,可以被 2 整除
20 不是质数,可以被 4 整除
20 不是质数,可以被 5 整除
20 不是质数,可以被 10 整除
20 是质数
21 不是质数,可以被 3 整除
21 不是质数,可以被 7 整除
21 是质数
22 不是质数,可以被 2 整除
22 不是质数,可以被 11 整除
22 是质数
23 是质数
24 不是质数,可以被 2 整除
24 不是质数,可以被 3 整除
24 不是质数,可以被 4 整除
24 不是质数,可以被 6 整除
24 不是质数,可以被 8 整除
24 不是质数,可以被 12 整除
24 是质数
25 不是质数,可以被 5 整除
25 是质数
26 不是质数,可以被 2 整除
26 不是质数,可以被 13 整除
26 是质数
27 不是质数,可以被 3 整除
27 不是质数,可以被 9 整除
27 是质数
28 不是质数,可以被 2 整除
28 不是质数,可以被 4 整除
28 不是质数,可以被 7 整除
28 不是质数,可以被 14 整除
28 是质数
29 是质数
30 不是质数,可以被 2 整除
30 不是质数,可以被 3 整除
30 不是质数,可以被 5 整除
30 不是质数,可以被 6 整除
30 不是质数,可以被 10 整除
30 不是质数,可以被 15 整除
30 是质数
31 是质数
32 不是质数,可以被 2 整除
32 不是质数,可以被 4 整除
32 不是质数,可以被 8 整除
32 不是质数,可以被 16 整除
32 是质数
33 不是质数,可以被 3 整除
33 不是质数,可以被 11 整除
33 是质数
34 不是质数,可以被 2 整除
34 不是质数,可以被 17 整除
34 是质数
35 不是质数,可以被 5 整除
35 不是质数,可以被 7 整除
35 是质数
36 不是质数,可以被 2 整除
36 不是质数,可以被 3 整除
36 不是质数,可以被 4 整除
36 不是质数,可以被 6 整除
36 不是质数,可以被 9 整除
36 不是质数,可以被 12 整除
36 不是质数,可以被 18 整除
36 是质数
37 是质数
38 不是质数,可以被 2 整除
38 不是质数,可以被 19 整除
38 是质数
39 不是质数,可以被 3 整除
39 不是质数,可以被 13 整除
39 是质数
40 不是质数,可以被 2 整除
40 不是质数,可以被 4 整除
40 不是质数,可以被 5 整除
40 不是质数,可以被 8 整除
40 不是质数,可以被 10 整除
40 不是质数,可以被 20 整除
40 是质数
41 是质数
42 不是质数,可以被 2 整除
42 不是质数,可以被 3 整除
42 不是质数,可以被 6 整除
42 不是质数,可以被 7 整除
42 不是质数,可以被 14 整除
42 不是质数,可以被 21 整除
42 是质数
43 是质数
44 不是质数,可以被 2 整除
44 不是质数,可以被 4 整除
44 不是质数,可以被 11 整除
44 不是质数,可以被 22 整除
44 是质数
45 不是质数,可以被 3 整除
45 不是质数,可以被 5 整除
45 不是质数,可以被 9 整除
45 不是质数,可以被 15 整除
45 是质数
46 不是质数,可以被 2 整除
46 不是质数,可以被 23 整除
46 是质数
47 是质数
48 不是质数,可以被 2 整除
48 不是质数,可以被 3 整除
48 不是质数,可以被 4 整除
48 不是质数,可以被 6 整除
48 不是质数,可以被 8 整除
48 不是质数,可以被 12 整除
48 不是质数,可以被 16 整除
48 不是质数,可以被 24 整除
48 是质数
49 不是质数,可以被 7 整除
49 是质数
50 不是质数,可以被 2 整除
50 不是质数,可以被 5 整除
50 不是质数,可以被 10 整除
50 不是质数,可以被 25 整除
50 是质数
51 不是质数,可以被 3 整除
51 不是质数,可以被 17 整除
51 是质数
52 不是质数,可以被 2 整除
52 不是质数,可以被 4 整除
52 不是质数,可以被 13 整除
52 不是质数,可以被 26 整除
52 是质数
53 是质数
54 不是质数,可以被 2 整除
54 不是质数,可以被 3 整除
54 不是质数,可以被 6 整除
54 不是质数,可以被 9 整除
54 不是质数,可以被 18 整除
54 不是质数,可以被 27 整除
54 是质数
55 不是质数,可以被 5 整除
55 不是质数,可以被 11 整除
55 是质数
56 不是质数,可以被 2 整除
56 不是质数,可以被 4 整除
56 不是质数,可以被 7 整除
56 不是质数,可以被 8 整除
56 不是质数,可以被 14 整除
56 不是质数,可以被 28 整除
56 是质数
57 不是质数,可以被 3 整除
57 不是质数,可以被 19 整除
57 是质数
58 不是质数,可以被 2 整除
58 不是质数,可以被 29 整除
58 是质数
59 是质数
60 不是质数,可以被 2 整除
60 不是质数,可以被 3 整除
60 不是质数,可以被 4 整除
60 不是质数,可以被 5 整除
60 不是质数,可以被 6 整除
60 不是质数,可以被 10 整除
60 不是质数,可以被 12 整除
60 不是质数,可以被 15 整除
60 不是质数,可以被 20 整除
60 不是质数,可以被 30 整除
60 是质数
61 是质数
62 不是质数,可以被 2 整除
62 不是质数,可以被 31 整除
62 是质数
63 不是质数,可以被 3 整除
63 不是质数,可以被 7 整除
63 不是质数,可以被 9 整除
63 不是质数,可以被 21 整除
63 是质数
64 不是质数,可以被 2 整除
64 不是质数,可以被 4 整除
64 不是质数,可以被 8 整除
64 不是质数,可以被 16 整除
64 不是质数,可以被 32 整除
64 是质数
65 不是质数,可以被 5 整除
65 不是质数,可以被 13 整除
65 是质数
66 不是质数,可以被 2 整除
66 不是质数,可以被 3 整除
66 不是质数,可以被 6 整除
66 不是质数,可以被 11 整除
66 不是质数,可以被 22 整除
66 不是质数,可以被 33 整除
66 是质数
67 是质数
68 不是质数,可以被 2 整除
68 不是质数,可以被 4 整除
68 不是质数,可以被 17 整除
68 不是质数,可以被 34 整除
68 是质数
69 不是质数,可以被 3 整除
69 不是质数,可以被 23 整除
69 是质数
70 不是质数,可以被 2 整除
70 不是质数,可以被 5 整除
70 不是质数,可以被 7 整除
70 不是质数,可以被 10 整除
70 不是质数,可以被 14 整除
70 不是质数,可以被 35 整除
70 是质数
71 是质数
72 不是质数,可以被 2 整除
72 不是质数,可以被 3 整除
72 不是质数,可以被 4 整除
72 不是质数,可以被 6 整除
72 不是质数,可以被 8 整除
72 不是质数,可以被 9 整除
72 不是质数,可以被 12 整除
72 不是质数,可以被 18 整除
72 不是质数,可以被 24 整除
72 不是质数,可以被 36 整除
72 是质数
73 是质数
74 不是质数,可以被 2 整除
74 不是质数,可以被 37 整除
74 是质数
75 不是质数,可以被 3 整除
75 不是质数,可以被 5 整除
75 不是质数,可以被 15 整除
75 不是质数,可以被 25 整除
75 是质数
76 不是质数,可以被 2 整除
76 不是质数,可以被 4 整除
76 不是质数,可以被 19 整除
76 不是质数,可以被 38 整除
76 是质数
77 不是质数,可以被 7 整除
77 不是质数,可以被 11 整除
77 是质数
78 不是质数,可以被 2 整除
78 不是质数,可以被 3 整除
78 不是质数,可以被 6 整除
78 不是质数,可以被 13 整除
78 不是质数,可以被 26 整除
78 不是质数,可以被 39 整除
78 是质数
79 是质数
80 不是质数,可以被 2 整除
80 不是质数,可以被 4 整除
80 不是质数,可以被 5 整除
80 不是质数,可以被 8 整除
80 不是质数,可以被 10 整除
80 不是质数,可以被 16 整除
80 不是质数,可以被 20 整除
80 不是质数,可以被 40 整除
80 是质数
81 不是质数,可以被 3 整除
81 不是质数,可以被 9 整除
81 不是质数,可以被 27 整除
81 是质数
82 不是质数,可以被 2 整除
82 不是质数,可以被 41 整除
82 是质数
83 是质数
84 不是质数,可以被 2 整除
84 不是质数,可以被 3 整除
84 不是质数,可以被 4 整除
84 不是质数,可以被 6 整除
84 不是质数,可以被 7 整除
84 不是质数,可以被 12 整除
84 不是质数,可以被 14 整除
84 不是质数,可以被 21 整除
84 不是质数,可以被 28 整除
84 不是质数,可以被 42 整除
84 是质数
85 不是质数,可以被 5 整除
85 不是质数,可以被 17 整除
85 是质数
86 不是质数,可以被 2 整除
86 不是质数,可以被 43 整除
86 是质数
87 不是质数,可以被 3 整除
87 不是质数,可以被 29 整除
87 是质数
88 不是质数,可以被 2 整除
88 不是质数,可以被 4 整除
88 不是质数,可以被 8 整除
88 不是质数,可以被 11 整除
88 不是质数,可以被 22 整除
88 不是质数,可以被 44 整除
88 是质数
89 是质数
90 不是质数,可以被 2 整除
90 不是质数,可以被 3 整除
90 不是质数,可以被 5 整除
90 不是质数,可以被 6 整除
90 不是质数,可以被 9 整除
90 不是质数,可以被 10 整除
90 不是质数,可以被 15 整除
90 不是质数,可以被 18 整除
90 不是质数,可以被 30 整除
90 不是质数,可以被 45 整除
90 是质数
91 不是质数,可以被 7 整除
91 不是质数,可以被 13 整除
91 是质数
92 不是质数,可以被 2 整除
92 不是质数,可以被 4 整除
92 不是质数,可以被 23 整除
92 不是质数,可以被 46 整除
92 是质数
93 不是质数,可以被 3 整除
93 不是质数,可以被 31 整除
93 是质数
94 不是质数,可以被 2 整除
94 不是质数,可以被 47 整除
94 是质数
95 不是质数,可以被 5 整除
95 不是质数,可以被 19 整除
95 是质数
96 不是质数,可以被 2 整除
96 不是质数,可以被 3 整除
96 不是质数,可以被 4 整除
96 不是质数,可以被 6 整除
96 不是质数,可以被 8 整除
96 不是质数,可以被 12 整除
96 不是质数,可以被 16 整除
96 不是质数,可以被 24 整除
96 不是质数,可以被 32 整除
96 不是质数,可以被 48 整除
96 是质数
97 是质数
98 不是质数,可以被 2 整除
98 不是质数,可以被 7 整除
98 不是质数,可以被 14 整除
98 不是质数,可以被 49 整除
98 是质数
99 不是质数,可以被 3 整除
99 不是质数,可以被 9 整除
99 不是质数,可以被 11 整除
99 不是质数,可以被 33 整除
99 是质数
>>> 
 RESTART: C:/Users/root/AppData/Local/Programs/Python/Python36-32/输出100以内质数和非质数，并输出可以被那些数整除.py 
2 是质数
3 是质数
4 不是质数,可以被 2 整除
4 是质数
5 是质数
6 不是质数,可以被 2 整除
6 不是质数,可以被 3 整除
6 是质数
7 是质数
8 不是质数,可以被 2 整除
8 不是质数,可以被 4 整除
8 是质数
9 不是质数,可以被 3 整除
9 是质数
10 不是质数,可以被 2 整除
10 不是质数,可以被 5 整除
10 是质数
11 是质数
12 不是质数,可以被 2 整除
12 不是质数,可以被 3 整除
12 不是质数,可以被 4 整除
12 不是质数,可以被 6 整除
12 是质数
13 是质数
14 不是质数,可以被 2 整除
14 不是质数,可以被 7 整除
14 是质数
15 不是质数,可以被 3 整除
15 不是质数,可以被 5 整除
15 是质数
16 不是质数,可以被 2 整除
16 不是质数,可以被 4 整除
16 不是质数,可以被 8 整除
16 是质数
17 是质数
18 不是质数,可以被 2 整除
18 不是质数,可以被 3 整除
18 不是质数,可以被 6 整除
18 不是质数,可以被 9 整除
18 是质数
19 是质数
20 不是质数,可以被 2 整除
20 不是质数,可以被 4 整除
20 不是质数,可以被 5 整除
20 不是质数,可以被 10 整除
20 是质数
21 不是质数,可以被 3 整除
21 不是质数,可以被 7 整除
21 是质数
22 不是质数,可以被 2 整除
22 不是质数,可以被 11 整除
22 是质数
23 是质数
24 不是质数,可以被 2 整除
24 不是质数,可以被 3 整除
24 不是质数,可以被 4 整除
24 不是质数,可以被 6 整除
24 不是质数,可以被 8 整除
24 不是质数,可以被 12 整除
24 是质数
25 不是质数,可以被 5 整除
25 是质数
26 不是质数,可以被 2 整除
26 不是质数,可以被 13 整除
26 是质数
27 不是质数,可以被 3 整除
27 不是质数,可以被 9 整除
27 是质数
28 不是质数,可以被 2 整除
28 不是质数,可以被 4 整除
28 不是质数,可以被 7 整除
28 不是质数,可以被 14 整除
28 是质数
29 是质数
30 不是质数,可以被 2 整除
30 不是质数,可以被 3 整除
30 不是质数,可以被 5 整除
30 不是质数,可以被 6 整除
30 不是质数,可以被 10 整除
30 不是质数,可以被 15 整除
30 是质数
31 是质数
32 不是质数,可以被 2 整除
32 不是质数,可以被 4 整除
32 不是质数,可以被 8 整除
32 不是质数,可以被 16 整除
32 是质数
33 不是质数,可以被 3 整除
33 不是质数,可以被 11 整除
33 是质数
34 不是质数,可以被 2 整除
34 不是质数,可以被 17 整除
34 是质数
35 不是质数,可以被 5 整除
35 不是质数,可以被 7 整除
35 是质数
36 不是质数,可以被 2 整除
36 不是质数,可以被 3 整除
36 不是质数,可以被 4 整除
36 不是质数,可以被 6 整除
36 不是质数,可以被 9 整除
36 不是质数,可以被 12 整除
36 不是质数,可以被 18 整除
36 是质数
37 是质数
38 不是质数,可以被 2 整除
38 不是质数,可以被 19 整除
38 是质数
39 不是质数,可以被 3 整除
39 不是质数,可以被 13 整除
39 是质数
40 不是质数,可以被 2 整除
40 不是质数,可以被 4 整除
40 不是质数,可以被 5 整除
40 不是质数,可以被 8 整除
40 不是质数,可以被 10 整除
40 不是质数,可以被 20 整除
40 是质数
41 是质数
42 不是质数,可以被 2 整除
42 不是质数,可以被 3 整除
42 不是质数,可以被 6 整除
42 不是质数,可以被 7 整除
42 不是质数,可以被 14 整除
42 不是质数,可以被 21 整除
42 是质数
43 是质数
44 不是质数,可以被 2 整除
44 不是质数,可以被 4 整除
44 不是质数,可以被 11 整除
44 不是质数,可以被 22 整除
44 是质数
45 不是质数,可以被 3 整除
45 不是质数,可以被 5 整除
45 不是质数,可以被 9 整除
45 不是质数,可以被 15 整除
45 是质数
46 不是质数,可以被 2 整除
46 不是质数,可以被 23 整除
46 是质数
47 是质数
48 不是质数,可以被 2 整除
48 不是质数,可以被 3 整除
48 不是质数,可以被 4 整除
48 不是质数,可以被 6 整除
48 不是质数,可以被 8 整除
48 不是质数,可以被 12 整除
48 不是质数,可以被 16 整除
48 不是质数,可以被 24 整除
48 是质数
49 不是质数,可以被 7 整除
49 是质数
50 不是质数,可以被 2 整除
50 不是质数,可以被 5 整除
50 不是质数,可以被 10 整除
50 不是质数,可以被 25 整除
50 是质数
51 不是质数,可以被 3 整除
51 不是质数,可以被 17 整除
51 是质数
52 不是质数,可以被 2 整除
52 不是质数,可以被 4 整除
52 不是质数,可以被 13 整除
52 不是质数,可以被 26 整除
52 是质数
53 是质数
54 不是质数,可以被 2 整除
54 不是质数,可以被 3 整除
54 不是质数,可以被 6 整除
54 不是质数,可以被 9 整除
54 不是质数,可以被 18 整除
54 不是质数,可以被 27 整除
54 是质数
55 不是质数,可以被 5 整除
55 不是质数,可以被 11 整除
55 是质数
56 不是质数,可以被 2 整除
56 不是质数,可以被 4 整除
56 不是质数,可以被 7 整除
56 不是质数,可以被 8 整除
56 不是质数,可以被 14 整除
56 不是质数,可以被 28 整除
56 是质数
57 不是质数,可以被 3 整除
57 不是质数,可以被 19 整除
57 是质数
58 不是质数,可以被 2 整除
58 不是质数,可以被 29 整除
58 是质数
59 是质数
60 不是质数,可以被 2 整除
60 不是质数,可以被 3 整除
60 不是质数,可以被 4 整除
60 不是质数,可以被 5 整除
60 不是质数,可以被 6 整除
60 不是质数,可以被 10 整除
60 不是质数,可以被 12 整除
60 不是质数,可以被 15 整除
60 不是质数,可以被 20 整除
60 不是质数,可以被 30 整除
60 是质数
61 是质数
62 不是质数,可以被 2 整除
62 不是质数,可以被 31 整除
62 是质数
63 不是质数,可以被 3 整除
63 不是质数,可以被 7 整除
63 不是质数,可以被 9 整除
63 不是质数,可以被 21 整除
63 是质数
64 不是质数,可以被 2 整除
64 不是质数,可以被 4 整除
64 不是质数,可以被 8 整除
64 不是质数,可以被 16 整除
64 不是质数,可以被 32 整除
64 是质数
65 不是质数,可以被 5 整除
65 不是质数,可以被 13 整除
65 是质数
66 不是质数,可以被 2 整除
66 不是质数,可以被 3 整除
66 不是质数,可以被 6 整除
66 不是质数,可以被 11 整除
66 不是质数,可以被 22 整除
66 不是质数,可以被 33 整除
66 是质数
67 是质数
68 不是质数,可以被 2 整除
68 不是质数,可以被 4 整除
68 不是质数,可以被 17 整除
68 不是质数,可以被 34 整除
68 是质数
69 不是质数,可以被 3 整除
69 不是质数,可以被 23 整除
69 是质数
70 不是质数,可以被 2 整除
70 不是质数,可以被 5 整除
70 不是质数,可以被 7 整除
70 不是质数,可以被 10 整除
70 不是质数,可以被 14 整除
70 不是质数,可以被 35 整除
70 是质数
71 是质数
72 不是质数,可以被 2 整除
72 不是质数,可以被 3 整除
72 不是质数,可以被 4 整除
72 不是质数,可以被 6 整除
72 不是质数,可以被 8 整除
72 不是质数,可以被 9 整除
72 不是质数,可以被 12 整除
72 不是质数,可以被 18 整除
72 不是质数,可以被 24 整除
72 不是质数,可以被 36 整除
72 是质数
73 是质数
74 不是质数,可以被 2 整除
74 不是质数,可以被 37 整除
74 是质数
75 不是质数,可以被 3 整除
75 不是质数,可以被 5 整除
75 不是质数,可以被 15 整除
75 不是质数,可以被 25 整除
75 是质数
76 不是质数,可以被 2 整除
76 不是质数,可以被 4 整除
76 不是质数,可以被 19 整除
76 不是质数,可以被 38 整除
76 是质数
77 不是质数,可以被 7 整除
77 不是质数,可以被 11 整除
77 是质数
78 不是质数,可以被 2 整除
78 不是质数,可以被 3 整除
78 不是质数,可以被 6 整除
78 不是质数,可以被 13 整除
78 不是质数,可以被 26 整除
78 不是质数,可以被 39 整除
78 是质数
79 是质数
80 不是质数,可以被 2 整除
80 不是质数,可以被 4 整除
80 不是质数,可以被 5 整除
80 不是质数,可以被 8 整除
80 不是质数,可以被 10 整除
80 不是质数,可以被 16 整除
80 不是质数,可以被 20 整除
80 不是质数,可以被 40 整除
80 是质数
81 不是质数,可以被 3 整除
81 不是质数,可以被 9 整除
81 不是质数,可以被 27 整除
81 是质数
82 不是质数,可以被 2 整除
82 不是质数,可以被 41 整除
82 是质数
83 是质数
84 不是质数,可以被 2 整除
84 不是质数,可以被 3 整除
84 不是质数,可以被 4 整除
84 不是质数,可以被 6 整除
84 不是质数,可以被 7 整除
84 不是质数,可以被 12 整除
84 不是质数,可以被 14 整除
84 不是质数,可以被 21 整除
84 不是质数,可以被 28 整除
84 不是质数,可以被 42 整除
84 是质数
85 不是质数,可以被 5 整除
85 不是质数,可以被 17 整除
85 是质数
86 不是质数,可以被 2 整除
86 不是质数,可以被 43 整除
86 是质数
87 不是质数,可以被 3 整除
87 不是质数,可以被 29 整除
87 是质数
88 不是质数,可以被 2 整除
88 不是质数,可以被 4 整除
88 不是质数,可以被 8 整除
88 不是质数,可以被 11 整除
88 不是质数,可以被 22 整除
88 不是质数,可以被 44 整除
88 是质数
89 是质数
90 不是质数,可以被 2 整除
90 不是质数,可以被 3 整除
90 不是质数,可以被 5 整除
90 不是质数,可以被 6 整除
90 不是质数,可以被 9 整除
90 不是质数,可以被 10 整除
90 不是质数,可以被 15 整除
90 不是质数,可以被 18 整除
90 不是质数,可以被 30 整除
90 不是质数,可以被 45 整除
90 是质数
91 不是质数,可以被 7 整除
91 不是质数,可以被 13 整除
91 是质数
92 不是质数,可以被 2 整除
92 不是质数,可以被 4 整除
92 不是质数,可以被 23 整除
92 不是质数,可以被 46 整除
92 是质数
93 不是质数,可以被 3 整除
93 不是质数,可以被 31 整除
93 是质数
94 不是质数,可以被 2 整除
94 不是质数,可以被 47 整除
94 是质数
95 不是质数,可以被 5 整除
95 不是质数,可以被 19 整除
95 是质数
96 不是质数,可以被 2 整除
96 不是质数,可以被 3 整除
96 不是质数,可以被 4 整除
96 不是质数,可以被 6 整除
96 不是质数,可以被 8 整除
96 不是质数,可以被 12 整除
96 不是质数,可以被 16 整除
96 不是质数,可以被 24 整除
96 不是质数,可以被 32 整除
96 不是质数,可以被 48 整除
96 是质数
97 是质数
98 不是质数,可以被 2 整除
98 不是质数,可以被 7 整除
98 不是质数,可以被 14 整除
98 不是质数,可以被 49 整除
98 是质数
99 不是质数,可以被 3 整除
99 不是质数,可以被 9 整除
99 不是质数,可以被 11 整除
99 不是质数,可以被 33 整除
99 是质数
>>> 
